namespace homework
{
    internal class Program
    {/*

Задание 6
Пользователь вводит с клавиатуры показания температуры. В зависимости от выбора пользователя программа переводит температуру из Фаренгейта в Цельсий
или наоборот.

Задание 7
Пользователь вводит с клавиатуры два числа. Нужно
показать все четные числа в указанном диапазоне. Если
границы диапазона указаны неправильно требуется произвести нормализацию границ. Например, пользователь
ввел 20 и 11, требуется нормализация, после которой
начало диапазона станет равно 11, а конец 20.
*/
        static void Main(string[] args)
        {
            //Task1.Result();
            //Task2.Result();
            //Task3.Result();
            //Task4.Result();
            //Task5.Result();
            Task6.Result();


        }
    }
}
